app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Yeni"], ["created_at", 2017-02-09 14:00:44 UTC], ["updated_at", 2017-02-09 14:00:44 UTC]]
---
  def create
    @category = Category.new(strong_params)

    if @category.save