app/controllers/posts_controller.rb

  def create
    @post = Post.new(strong_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Deneme"], ["body", "sdfewfewwef"], ["created_at", 2017-02-09 14:00:53 UTC], ["updated_at", 2017-02-09 14:00:53 UTC], ["category_id", 1]]

  def show
    @posts = Post.all
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    if @post.update(strong_params)
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Blog Deneme"], ["updated_at", 2017-02-28 15:39:16 UTC], ["id", 1]]

  def load_categories
  	@categories = Category.all.collect {|c| [c.name, c.id]}
---
SELECT "categories".* FROM "categories"