app/controllers/programs_controller.rb

SELECT "programs".* FROM "programs"
---
  def index
    @programs = Program.all

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_program
    @program = Program.find(params[:id])