app/views/categories/show.html.haml

SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1  [["category_id", 1]]
---
-@category.posts.each do |post|